# FormElemRegenSelfIntersectionResetConnections Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FormFailures..::..FormElemRegenSelfIntersectionResetConnections Property
BuiltInFailures..::..FormFailures Class See Also
---
This form cannot be created due to self-intersecting geometry. Clicking the Reset Connections button will attempt to solve this problem.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FormElemRegenSelfIntersectionResetConnections { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FormElemRegenSelfIntersectionResetConnections As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FormElemRegenSelfIntersectionResetConnections {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FormFailures Class
Autodesk.Revit.DB Namespace